{"id":"sop-01","document_type":"sop","text":"To resolve overheating issues: shut down the machine, inspect coolant filters, clean or replace filters, verify coolant flow, and restart the machine.","metadata":{"system":"coolant","procedure_type":"corrective"}}
{"id":"sop-02","document_type":"sop","text":"For vibration issues: stop operation, inspect bearings, replace worn components, recalibrate spindle, and perform test run.","metadata":{"system":"spindle","procedure_type":"corrective"}}
{"id":"sop-03","document_type":"sop","text":"If a sensor fault occurs: power down the machine, inspect sensor wiring, replace faulty sensors, and recalibrate.","metadata":{"system":"sensors","procedure_type":"corrective"}}
{"id":"sop-04","document_type":"sop","text":"To correct axis misalignment: loosen mounting bolts, realign axis using calibration tools, tighten bolts, and validate accuracy.","metadata":{"system":"motion","procedure_type":"corrective"}}
{"id":"sop-05","document_type":"sop","text":"For power instability: inspect power supply, replace faulty units, verify grounding, and test voltage stability.","metadata":{"system":"power","procedure_type":"corrective"}}
{"id":"sop-06","document_type":"sop","text":"Lubrication maintenance procedure: check oil levels daily, refill as needed, inspect lines for blockage, and verify flow.","metadata":{"system":"lubrication","procedure_type":"preventive"}}
{"id":"sop-07","document_type":"sop","text":"Tool change troubleshooting: remove debris from tool magazine, inspect actuators, lubricate moving parts, and test tool changes.","metadata":{"system":"tooling","procedure_type":"corrective"}}
{"id":"sop-08","document_type":"sop","text":"Heat exchanger cleaning procedure: isolate coolant system, flush exchanger, inspect for clogs, and restore coolant flow.","metadata":{"system":"cooling","procedure_type":"preventive"}}
{"id":"sop-09","document_type":"sop","text":"Controller recovery procedure: restore configuration from backup, verify firmware version, and perform system restart.","metadata":{"system":"controller","procedure_type":"corrective"}}
{"id":"sop-10","document_type":"sop","text":"Mechanical noise inspection: stop machine, inspect belts and fasteners, adjust tension, and resume operation after validation.","metadata":{"system":"mechanical","procedure_type":"corrective"}}
